In [3]:
import pandas as pd
import numpy as np

In [ ]:
DataFrame.rename_axis(mapper=<no_default>, *, index=<no_default>, columns=<no_default>, axis=0, copy=None, inplace=False)

Set the name of the axis for the index or columns.

mapper: scalar, list-like, optional
        Value to set the axis name attribute.

index, columns : scalar, list-like, dict-like or function, optional
                 A scalar, list-like, dict-like or functions transformations to apply to that axis’ values.
                 Note that the columns parameter is not allowed if the object is a Series.
                 This parameter only apply for DataFrame type objects.
                 Use either mapper and axis to specify the axis to target with mapper, or index and/or columns.

axis    : {0 or ‘index’, 1 or ‘columns’}, default 0
         The axis to rename. 
          For Series this parameter is unused and defaults to 0.

copy : bool, default None
         Also copy underlying data.

inplace: bool, default False
          Modifies the object directly, instead of creating a new Series or DataFrame.

In [ ]:
### Series

In [4]:
s = pd.Series(["dog", "cat", "monkey"])
s

0       dog
1       cat
2    monkey
dtype: object

In [5]:
s.rename_axis("animal")

animal
0       dog
1       cat
2    monkey
dtype: object

M4      num_legs  num_arms
M3
dog            4         0
cat            4         0
monkey         2         2

In [ ]:
### DataFrame

In [34]:
df = pd.DataFrame({"num_legs": [4, 4, 2],
                   "num_arms": [0, 0, 2]},
                  ["dog", "cat", "monkey"])
df

        num_legs  num_arms
dog            4         0
cat            4         0
monkey         2         2

In [7]:
df = df.rename_axis("animal")
df

        num_legs  num_arms
animal
dog            4         0
cat            4         0
monkey         2         2

In [8]:
df = df.rename_axis("limbs", axis="columns")
df

limbs   num_legs  num_arms
animal
dog            4         0
cat            4         0
monkey         2         2

In [ ]:
### MultiIndex

In [12]:
df.index = pd.MultiIndex.from_product([['mammal'],
                                       ['dog', 'cat', 'monkey']],
                                      names=['type', 'name'])
df

limbs          num_legs  num_arms
type   name
mammal dog            4         0
       cat            4         0
       monkey         2         2

In [13]:
df.rename_axis(index={'type': 'class'})

limbs          num_legs  num_arms
class  name
mammal dog            4         0
       cat            4         0
       monkey         2         2

In [14]:
df.rename_axis(columns=str.upper)

LIMBS          num_legs  num_arms
type   name
mammal dog            4         0
       cat            4         0
       monkey         2         2

In [39]:
###mine
# df.rename_axis(mapper ="M1"  ,axis=0, inplace=True)
# df.rename_axis(mapper ="M2"  ,axis=1, inplace=True)
# df.rename_axis(index  ="M3"  ,inplace=True)
# df.rename_axis(columns="M4"  ,inplace=True)
# df

M4      num_legs  num_arms
M3
dog            4         0
cat            4         0
monkey         2         2

In [35]:
df

        num_legs  num_arms
dog            4         0
cat            4         0
monkey         2         2